nikitalita/NuMicro-8051-prog/bootloader/inc/function_define_n76e003.h
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* SPDX-License-Identifier: Apache-2.0                                                                     */
/* Copyright(c) 2023 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/
/*  function_define_n76e003.h                                                      */
/*  All IP function define for Nuvoton                                                  */
/*  MG51FB9AE / MG51XB9AE / MG51FC9AE / MG51XC9AE /                                     */
/*--------------------------------------------------------------------------------------*/

#ifdef __CDT_PARSER__         /* For __SDCC__ */
  #define __data
  #define __near
  #define __idata
  #define __xdata
  #define __far
  #define __pdata
  #define __code
  #define __bit
  #define __sfr
  #define __sbit
  #define __critical
  #define __at(x)             /* use "__at (0xab)" instead of "__at 0xab" */
  #define __using(x)
  #define __interrupt(x)
  #define __naked
#endif

typedef unsigned char         UINT8;
typedef unsigned int          UINT16;
typedef unsigned long         UINT32;
typedef signed char           INT8;
typedef signed int            INT16;
typedef signed long           INT32;

#if defined __C51__
typedef bit                   BIT;
typedef unsigned char         uint8_t;
typedef unsigned int          uint16_t;
typedef unsigned long         uint32_t;
typedef signed char           int8_t;
typedef signed int            int16_t;
typedef signed long           int32_t;
#elif defined __ICC8051__
#define BIT __no_init bool __bit
typedef unsigned char         uint8_t;
typedef unsigned int          uint16_t;
typedef unsigned long         uint32_t;
typedef signed char           int8_t;
typedef signed int            int16_t;
typedef signed long           int32_t;
#elif defined __SDCC__
typedef __bit                 BIT;
#endif

#define Disable  0
#define Enable   1

#define DISABLE  0
#define ENABLE   1 

#define TRUE     1  
#define FALSE    0  
                    
#define FAIL     1  
#define PASS     0  
                  
//16 --> 8 x 2
#define HIBYTE(v1)              ((UINT8)((v1)>>8))                      //v1 is UINT16
#define LOBYTE(v1)              ((UINT8)((v1)&0xFF))
//8 x 2 --> 16
#define MAKEWORD(v1,v2)         ((((UINT16)(v1))<<8)+(UINT16)(v2))      //v1,v2 is UINT8
//8 x 4 --> 32
#define MAKELONG(v1,v2,v3,v4)   (UINT32)((v1<<32)+(v2<<16)+(v3<<8)+v4)  //v1,v2,v3,v4 is UINT8
//32 --> 16 x 2
#define YBYTE1(v1)              ((UINT16)((v1)>>16))                    //v1 is UINT32
#define YBYTE0(v1)              ((UINT16)((v1)&0xFFFF))
//32 --> 8 x 4
#define TBYTE3(v1)              ((UINT8)((v1)>>24))                     //v1 is UINT32
#define TBYTE2(v1)              ((UINT8)((v1)>>16))
#define TBYTE1(v1)              ((UINT8)((v1)>>8)) 
#define TBYTE0(v1)              ((UINT8)((v1)&0xFF))

#define SET_BIT0        0x01
#define SET_BIT1        0x02
#define SET_BIT2        0x04
#define SET_BIT3        0x08
#define SET_BIT4        0x10
#define SET_BIT5        0x20
#define SET_BIT6        0x40
#define SET_BIT7        0x80

#define CLR_BIT0        0xFE
#define CLR_BIT1        0xFD
#define CLR_BIT2        0xFB
#define CLR_BIT3        0xF7
#define CLR_BIT4        0xEF
#define CLR_BIT5        0xDF
#define CLR_BIT6        0xBF
#define CLR_BIT7        0x7F

/*****************************************************************************/
/*   Stack and NOP                                                           */
/*****************************************************************************/
#if defined __C51__
#define   nop                                  _nop_()
#define   CALL_NOP                             _nop_()
#define   PUSH_SFRS                            _push_(SFRS)
#define   POP_SFRS                             _pop_(SFRS)
#elif defined __ICC8051__
#define _nop_()                                asm("nop") 
#define nop                                    asm("nop")
#define CALL_NOP                               asm("nop")
#define PUSH_SFRS                              asm(" PUSH 0x91")
#define POP_SFRS                               asm(" POP 0x91")
#define _push_(SFRS)                           asm(" PUSH 0x91")
#define _pop_(SFRS)                            asm(" POP 0x91")
#elif defined __SDCC__
#define _nop_()                                __asm__("nop;")
#define nop                                    __asm__("nop;")
#define CALL_NOP                               __asm__("nop;")
#define PUSH_SFRS                              __asm__(" PUSH 0x91;")
#define POP_SFRS                               __asm__(" POP 0x91;")
#define _push_(SFRS)                           __asm__(" PUSH 0x91;")
#define _pop_(SFRS)                            __asm__(" POP 0x91;")
#endif

/*****************************************************************************/
/*   general macros                                                          */
/*****************************************************************************/
#define _enable_TA TA=0xAA;TA=0x55 // Enable writes to a TA-protected register without disabling interrupts (ensure interrupts are disabled before writing to a TA-protected register)
#define _asgn_TAR(reg, val) _enable_TA;reg=val    // Assign (=) value to TA-protected register without disabling interrupts (ensure interrupts are disabled before using)
#define _anda_TAR(reg, val) _enable_TA;reg&=val   // And-assign (&=) value to TA-protected register without disabling interrupts (ensure interrupts are disabled before using)
#define _nanda_TAR(reg, val) _enable_TA;reg&=~val // Nand-assign (&=~) value to TA-protected register without disabling interrupts (ensure interrupts are disabled before using)
#define _ora_TAR(reg, val) _enable_TA;reg|=val    // Or-assign (|=) value to TA-protected register without disabling interrupts (ensure interrupts are disabled before using)
#define _xora_TAR(reg, val) _enable_TA;reg^=val   // Xor-assign (^=) value to TA-protected register without disabling interrupts (ensure interrupts are disabled before using)

#define asgn_TAR(reg, val) BIT_TMP=EA;EA=0;_asgn_TAR(reg, val);EA=BIT_TMP // Assign (=) value to TA-protected register
#define anda_TAR(reg, val) BIT_TMP=EA;EA=0;_anda_TAR(reg, val);EA=BIT_TMP // And-assign (&=) value to TA-protected register
#define nanda_TAR(reg, val) BIT_TMP=EA;EA=0;_nanda_TAR(reg, val);EA=BIT_TMP // Nand-assign (&=~) value to TA-protected register
#define ora_TAR(reg, val) BIT_TMP=EA;EA=0;_ora_TAR(reg, val);EA=BIT_TMP // Or-assign (|=) value to TA-protected register
#define xora_TAR(reg, val) BIT_TMP=EA;EA=0;_xora_TAR(reg, val);EA=BIT_TMP // Xor-assign (^=) value to TA-protected register

#define tmp_clr_EA(statement) BIT_TMP=EA;EA=0;statement;EA=BIT_TMP // Disable interrupts for the length of the statement, then enables them again if they were already enabled


/*****************************************************************************/
/*   sfr page select                                                          */
/*****************************************************************************/
#define    ENABLE_SFR_PAGE1                    set_SFRS_SFRPAGE
#define    ENABLE_SFR_PAGE0                    clr_SFRS_SFRPAGE

/*****************************************************************************/
/*   Software reset                                                          */
/*****************************************************************************/
#define    ENABLE_SOFTWARE_RESET_TO_APROM      clr_CHPCON_BS;set_CHPCON_SWRST
#define    ENABLE_SOFTWARE_RESET_TO_LDROM      set_CHPCON_BS;set_CHPCON_SWRST

/*****************************************************************************/
/*   Power down / idle mode define                                           */
/*****************************************************************************/
#define    ENABLE_POWERDOWN_MODE               set_PCON_PD
#define    ENABLE_IDLE_MODE                    set_PCON_IDLE

/*****************************************************************************/
/*   BOD Define                                                              */
/*****************************************************************************/
#define    BOD_ENABLE               BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0|=0x80;EA=BIT_TMP
#define    BOD_RESET_ENABLE         BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0|=0x84;EA=BIT_TMP
#define    BOD_DISABLE              BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0&=0x7B;EA=BIT_TMP
 /****/
#define    ENABLE_BOD               BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0|=0x80;EA=BIT_TMP
#define    ENABLE_BOD_RESET         BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0|=0x84;EA=BIT_TMP
#define    DISABLE_BOD              BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS=0;TA=0xAA;TA=0x55;BODCON0&=0x7B;EA=BIT_TMP

/*****************************************************************************/
/*    IAP function process                                                   */ 
/*****************************************************************************/
#define    PAGE_SIZE               128

