nikitalita/NuMicro-8051-prog/bootloader/inc/function_define_n76e003.h
#define   SET_INT_Timer2_LEVEL0        clr_EIP_PT2; clr_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL1        clr_EIP_PT2; set_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL2        set_EIP_PT2; clr_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL3        set_EIP_PT2; set_EIPH_PT2H

#define   SET_INT_CAPTURE_LEVEL0       clr_EIP_PCAP; clr_EIPH_PCAPH
#define   SET_INT_CAPTURE_LEVEL1       clr_EIP_PCAP; set_EIPH_PCAPH
#define   SET_INT_CAPTURE_LEVEL2       set_EIP_PCAP; clr_EIPH_PCAPH
#define   SET_INT_CAPTURE_LEVEL3       set_EIP_PCAP; set_EIPH_PCAPH

#define   SET_INT_PWM_LEVEL0           clr_EIP_PPWM; clr_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL1           clr_EIP_PPWM; set_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL2           set_EIP_PPWM; clr_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL3           set_EIP_PPWM; set_EIPH_PPWMH

#define   SET_INT_UART1_LEVEL0         clr_EIP1_PS_1; clr_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL1         clr_EIP1_PS_1; set_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL2         set_EIP1_PS_1; clr_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL3         set_EIP1_PS_1; set_EIPH1_PSH_1

#define   SET_INT_Timer3_LEVEL0        clr_EIP1_PT3; clr_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL1        clr_EIP1_PT3; set_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL2        set_EIP1_PT3; clr_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL3        set_EIP1_PT3; set_EIPH1_PT3H

#define   SET_INT_WKT_LEVEL0           clr_EIP1_PWKT; clr_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL1           clr_EIP1_PWKT; set_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL2           set_EIP1_PWKT; clr_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL3           set_EIP1_PWKT; set_EIPH1_PWKTH

/* Clear Interrupt Flag */
#define    CLEAR_ADC_INTERRUPT_FLAG          clr_ADCCON0_ADCF
#define    CLEAR_BOD_INTERRUPT_FLAG          clr_BODCON0_BOF
#define    CLEAR_BOD_RESET_FLAG              clr_BODCON0_BORF
#define    CLEAR_UART0_INTERRUPT_TX_FLAG     clr_SCON_TI
#define    CLEAR_UART0_INTERRUPT_RX_FLAG     clr_SCON_RI
#define    CLEAR_TIMER1_INTERRUPT_FLAG       clr_TCON_TF1
#define    CLEAR_INT1_INTERRUPT_FLAG         clr_TCON_IE1
#define    CLEAR_TIMER0_INTERRUPT_FLAG       clr_TCON_TF0
#define    CLEAR_INT0_INTERRUPT_FLAG         clr_TCON_IE0
#define    CLEAR_TIMER2_INTERRUPT_FLAG       clr_T2CON_TF2
#define    CLEAR_SPI0_INTERRUPT_FLAG         clr_SPSR_SPIF
#define    CLEAR_PWM0_FB_INTERRUPT_FLAG      clr_PWM0FBD_FBF
#define    CLEAR_WDT_INTERRUPT_FLAG          clr_WDCON_WDTF
#define    CLEAR_PWM0_INTERRUPT_FLAG         clr_PWM1CON0_PWMF
#define    CLEAR_CAPTURE_INTERRUPT_IC0_FLAG  clr_CAPCON0_CAPF0
#define    CLEAR_CAPTURE_INTERRUPT_IC1_FLAG  clr_CAPCON0_CAPF1
#define    CLEAR_CAPTURE_INTERRUPT_IC2_FLAG  clr_CAPCON0_CAPF2
#define    CLEAR_PIN_INTERRUPT_PIT0_FLAG     clr_PIF_PIF0
#define    CLEAR_PIN_INTERRUPT_PIT1_FLAG     clr_PIF_PIF1
#define    CLEAR_PIN_INTERRUPT_PIT2_FLAG     clr_PIF_PIF2
#define    CLEAR_PIN_INTERRUPT_PIT3_FLAG     clr_PIF_PIF3
#define    CLEAR_PIN_INTERRUPT_PIT4_FLAG     clr_PIF_PIF4
#define    CLEAR_PIN_INTERRUPT_PIT5_FLAG     clr_PIF_PIF5
#define    CLEAR_PIN_INTERRUPT_PIT6_FLAG     clr_PIF_PIF6
#define    CLEAR_PIN_INTERRUPT_PIT7_FLAG     clr_PIF_PIF7
#define    CLEAR_I2C_TIMEOUT_INTERRUPT_FLAG  clr_I2TOC_I2TOF
#define    CLEAR_WKT_INTERRUPT_FLAG          clr_WKCON_WKTF
#define    CLEAR_TIMER3_INTERRUPT_FLAG       clr_T3CON_TF3
#define    CLEAR_UART1_INTERRUPT_FLAG        clr_EIE1_ES_1 

/*****************************************************************************/
/*    For GPIO Mode setting                                                  */ 
/*****************************************************************************/
#define    P00_QUASI_MODE            P0M1&=0xFE;P0M2&=0xFE
#define    P01_QUASI_MODE            P0M1&=0xFD;P0M2&=0xFD
#define    P02_QUASI_MODE            P0M1&=0xFB;P0M2&=0xFB
#define    P03_QUASI_MODE            P0M1&=0xF7;P0M2&=0xF7
#define    P04_QUASI_MODE            P0M1&=0xEF;P0M2&=0xEF
#define    P05_QUASI_MODE            P0M1&=0xDF;P0M2&=0xDF
#define    P06_QUASI_MODE            P0M1&=0xBF;P0M2&=0xBF
#define    P07_QUASI_MODE            P0M1&=0x7F;P0M2&=0x7F
#define    P10_QUASI_MODE            P1M1&=0xFE;P1M2&=0xFE
#define    P11_QUASI_MODE            P1M1&=0xFD;P1M2&=0xFD
#define    P12_QUASI_MODE            P1M1&=0xFB;P1M2&=0xFB
#define    P13_QUASI_MODE            P1M1&=0xF7;P1M2&=0xF7
#define    P14_QUASI_MODE            P1M1&=0xEF;P1M2&=0xEF
#define    P15_QUASI_MODE            P1M1&=0xDF;P1M2&=0xDF
#define    P16_QUASI_MODE            P1M1&=0xBF;P1M2&=0xBF
#define    P17_QUASI_MODE            P1M1&=0x7F;P1M2&=0x7F
#define    P30_QUASI_MODE            P3M1&=0xFE;P3M2&=0xFE
#define    ALL_GPIO_QUASI_MODE       P0M1=0;P0M2=0;P1M1=0;P1M2=0;P3M1=0;P3M2=0

#define    P00_PUSHPULL_MODE         P0M1&=0xFE;P0M2|=0x01
#define    P01_PUSHPULL_MODE         P0M1&=0xFD;P0M2|=0x02
#define    P02_PUSHPULL_MODE         P0M1&=0xFB;P0M2|=0x04
#define    P03_PUSHPULL_MODE         P0M1&=0xF7;P0M2|=0x08
#define    P04_PUSHPULL_MODE         P0M1&=0xEF;P0M2|=0x10
#define    P05_PUSHPULL_MODE         P0M1&=0xDF;P0M2|=0x20
#define    P06_PUSHPULL_MODE         P0M1&=0xBF;P0M2|=0x40
#define    P07_PUSHPULL_MODE         P0M1&=0x7F;P0M2|=0x80
#define    P10_PUSHPULL_MODE         P1M1&=0xFE;P1M2|=0x01
#define    P11_PUSHPULL_MODE         P1M1&=0xFD;P1M2|=0x02
#define    P12_PUSHPULL_MODE         P1M1&=0xFB;P1M2|=0x04
#define    P13_PUSHPULL_MODE         P1M1&=0xF7;P1M2|=0x08
#define    P14_PUSHPULL_MODE         P1M1&=0xEF;P1M2|=0x10
#define    P15_PUSHPULL_MODE         P1M1&=0xDF;P1M2|=0x20
#define    P16_PUSHPULL_MODE         P1M1&=0xBF;P1M2|=0x40
#define    P17_PUSHPULL_MODE         P1M1&=0x7F;P1M2|=0x80
#define    P30_PUSHPULL_MODE         P3M1&=0xFE;P3M2|=0x01
#define    ALL_GPIO_PUSHPULL_MODE    P0M1=0;P0M2=0xFF;P1M1=0;P1M2=0xFF;P3M1=0;P3M2=0xFF

#define    P00_INPUT_MODE            P0M1|=0x01;P0M2&=0xFE
#define    P01_INPUT_MODE            P0M1|=0x02;P0M2&=0xFD
#define    P02_INPUT_MODE            P0M1|=0x04;P0M2&=0xFB
#define    P03_INPUT_MODE            P0M1|=0x08;P0M2&=0xF7
#define    P04_INPUT_MODE            P0M1|=0x10;P0M2&=0xEF
#define    P05_INPUT_MODE            P0M1|=0x20;P0M2&=0xDF
#define    P06_INPUT_MODE            P0M1|=0x40;P0M2&=0xBF
#define    P07_INPUT_MODE            P0M1|=0x80;P0M2&=0x7F
#define    P10_INPUT_MODE            P1M1|=0x01;P1M2&=0xFE
#define    P11_INPUT_MODE            P1M1|=0x02;P1M2&=0xFD
#define    P12_INPUT_MODE            P1M1|=0x04;P1M2&=0xFB
#define    P13_INPUT_MODE            P1M1|=0x08;P1M2&=0xF7
#define    P14_INPUT_MODE            P1M1|=0x10;P1M2&=0xEF
#define    P15_INPUT_MODE            P1M1|=0x20;P1M2&=0xDF
#define    P16_INPUT_MODE            P1M1|=0x40;P1M2&=0xBF
#define    P17_INPUT_MODE            P1M1|=0x80;P1M2&=0x7F
#define    P30_INPUT_MODE            P3M1|=0x01;P3M2&=0xFE
#define    ALL_GPIO_INPUT_MODE       P0M1=0xFF;P0M2=0;P1M1=0xFF;P1M2=0;P3M1=0xFF;P3M2=0

#define    P00_OPENDRAIN_MODE        P0M1|=0x01;P0M2|=0x01
#define    P01_OPENDRAIN_MODE        P0M1|=0x02;P0M2|=0x02
#define    P02_OPENDRAIN_MODE        P0M1|=0x04;P0M2|=0x04
#define    P03_OPENDRAIN_MODE        P0M1|=0x08;P0M2|=0x08
#define    P04_OPENDRAIN_MODE        P0M1|=0x10;P0M2|=0x10
#define    P05_OPENDRAIN_MODE        P0M1|=0x20;P0M2|=0x20
#define    P06_OPENDRAIN_MODE        P0M1|=0x40;P0M2|=0x40
#define    P07_OPENDRAIN_MODE        P0M1|=0x80;P0M2|=0x80
#define    P10_OPENDRAIN_MODE        P1M1|=0x01;P1M2|=0x01
#define    P11_OPENDRAIN_MODE        P1M1|=0x02;P1M2|=0x02
#define    P12_OPENDRAIN_MODE        P1M1|=0x04;P1M2|=0x04
#define    P13_OPENDRAIN_MODE        P1M1|=0x08;P1M2|=0x08
#define    P14_OPENDRAIN_MODE        P1M1|=0x10;P1M2|=0x10
#define    P15_OPENDRAIN_MODE        P1M1|=0x20;P1M2|=0x20
#define    P16_OPENDRAIN_MODE        P1M1|=0x40;P1M2|=0x40
#define    P17_OPENDRAIN_MODE        P1M1|=0x80;P1M2|=0x80
#define    P30_OPENDRAIN_MODE        P3M1|=0x01;P3M2|=0x01
#define    ALL_GPIO_OPENDRAIN_MODE   P0M1=0xFF;P0M2=0xFF;P1M1=0xFF;P1M2=0xFF;P3M1=0xFF;P3M2=0xFF

/*****************************************************************************/
/*    For GPIO Schmitt Trig / TTL Type Seetting                              */ 
/*****************************************************************************/
#define    ENABLE_P00_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x01;ENABLE_SFR_PAGE0
#define    ENABLE_P01_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x02;ENABLE_SFR_PAGE0
#define    ENABLE_P02_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x04;ENABLE_SFR_PAGE0
#define    ENABLE_P03_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x08;ENABLE_SFR_PAGE0
#define    ENABLE_P04_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x10;ENABLE_SFR_PAGE0
#define    ENABLE_P05_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x20;ENABLE_SFR_PAGE0
#define    ENABLE_P06_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x40;ENABLE_SFR_PAGE0
#define    ENABLE_P07_ST_MODE        ENABLE_SFR_PAGE1;P0S|=0x80;ENABLE_SFR_PAGE0
#define    ENABLE_P10_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x01;ENABLE_SFR_PAGE0
#define    ENABLE_P11_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x02;ENABLE_SFR_PAGE0
#define    ENABLE_P12_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x04;ENABLE_SFR_PAGE0
#define    ENABLE_P13_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x08;ENABLE_SFR_PAGE0
#define    ENABLE_P14_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x10;ENABLE_SFR_PAGE0
#define    ENABLE_P15_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x20;ENABLE_SFR_PAGE0
#define    ENABLE_P16_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x40;ENABLE_SFR_PAGE0
#define    ENABLE_P17_ST_MODE        ENABLE_SFR_PAGE1;P1S|=0x80;ENABLE_SFR_PAGE0
#define    ENABLE_P20_ST_MODE        ENABLE_SFR_PAGE1;P2S|=0x01;ENABLE_SFR_PAGE0
#define    ENABLE_P30_ST_MODE        ENABLE_SFR_PAGE1;P3S|=0x01;ENABLE_SFR_PAGE0

#define    ENABLE_P00_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xFE;ENABLE_SFR_PAGE0
#define    ENABLE_P01_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xFD;ENABLE_SFR_PAGE0
#define    ENABLE_P02_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xFB;ENABLE_SFR_PAGE0
#define    ENABLE_P03_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xF7;ENABLE_SFR_PAGE0
#define    ENABLE_P04_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xEF;ENABLE_SFR_PAGE0
#define    ENABLE_P05_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xDF;ENABLE_SFR_PAGE0
#define    ENABLE_P06_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0xBF;ENABLE_SFR_PAGE0
#define    ENABLE_P07_TTL_MODE       ENABLE_SFR_PAGE1;P0S&=0x7F;ENABLE_SFR_PAGE0
#define    ENABLE_P10_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xFE;ENABLE_SFR_PAGE0
#define    ENABLE_P11_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xFD;ENABLE_SFR_PAGE0
#define    ENABLE_P12_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xFB;ENABLE_SFR_PAGE0
#define    ENABLE_P13_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xF7;ENABLE_SFR_PAGE0
#define    ENABLE_P14_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xEF;ENABLE_SFR_PAGE0
#define    ENABLE_P15_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xDF;ENABLE_SFR_PAGE0
#define    ENABLE_P16_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0xBF;ENABLE_SFR_PAGE0
#define    ENABLE_P17_TTL_MODE       ENABLE_SFR_PAGE1;P1S&=0x7F;ENABLE_SFR_PAGE0
#define    ENABLE_P20_TTL_MODE       ENABLE_SFR_PAGE1;P2S&=0xFE;ENABLE_SFR_PAGE0
#define    ENABLE_P30_TTL_MODE       ENABLE_SFR_PAGE1;P3S&=0xFE;ENABLE_SFR_PAGE0

/*****************************************************************************/
/*    Enable GPIO Pin Interrupt port 0~3                                     */ 
/*****************************************************************************/
#define    ENABLE_INT_PORT0               PICON &= 0xFB;
#define    ENABLE_INT_PORT1               PICON |= 0x01;
#define    ENABLE_INT_PORT2               PICON |= 0x02;
#define    ENABLE_INT_PORT3               PICON |= 0x03;
/*    Bit low level trig mode   */
#define    ENABLE_BIT7_LOWLEVEL_TRIG      PICON&=0x7F;PINEN|=0x80;PIPEN&=0x7F
#define    ENABLE_BIT6_LOWLEVEL_TRIG      PICON&=0x7F;PINEN|=0x40;PIPEN&=0xBF
#define    ENABLE_BIT5_LOWLEVEL_TRIG      PICON&=0xBF;PINEN|=0x20;PIPEN&=0xDF
#define    ENABLE_BIT4_LOWLEVEL_TRIG      PICON&=0xBF;PINEN|=0x10;PIPEN&=0xEF
#define    ENABLE_BIT3_LOWLEVEL_TRIG      PICON&=0xDF;PINEN|=0x08;PIPEN&=0xF7
#define    ENABLE_BIT2_LOWLEVEL_TRIG      PICON&=0xEF;PINEN|=0x04;PIPEN&=0xFB
#define    ENABLE_BIT1_LOWLEVEL_TRIG      PICON&=0xF7;PINEN|=0x02;PIPEN&=0xFD
#define    ENABLE_BIT0_LOWLEVEL_TRIG      PICON&=0xFD;PINEN|=0x01;PIPEN&=0xFE
/*    Bit high level trig mode    */
#define    ENABLE_BIT7_HIGHLEVEL_TRIG     PICON&=0x7F;PINEN&=0x7F;PIPEN|=0x80
#define    ENABLE_BIT6_HIGHLEVEL_TRIG     PICON&=0x7F;PINEN&=0xBF;PIPEN|=0x40
#define    ENABLE_BIT5_HIGHLEVEL_TRIG     PICON&=0xBF;PINEN&=0xDF;PIPEN|=0x20
#define    ENABLE_BIT4_HIGHLEVEL_TRIG     PICON&=0xBF;PINEN&=0xEF;PIPEN|=0x10
#define    ENABLE_BIT3_HIGHLEVEL_TRIG     PICON&=0xDF;PINEN&=0xF7;PIPEN|=0x08
#define    ENABLE_BIT2_HIGHLEVEL_TRIG     PICON&=0xEF;PINEN&=0xFB;PIPEN|=0x04
#define    ENABLE_BIT1_HIGHLEVEL_TRIG     PICON&=0xF7;PINEN&=0xFD;PIPEN|=0x02
#define    ENABLE_BIT0_HIGHLEVEL_TRIG     PICON&=0xFD;PINEN&=0xFE;PIPEN|=0x01
/*    Bit falling edge trig mode   */
#define    ENABLE_BIT7_FALLINGEDGE_TRIG   PICON|=0x80;PINEN|=0x80;PIPEN&=0x7F
#define    ENABLE_BIT6_FALLINGEDGE_TRIG   PICON|=0x80;PINEN|=0x40;PIPEN&=0xBF
#define    ENABLE_BIT5_FALLINGEDGE_TRIG   PICON|=0x40;PINEN|=0x20;PIPEN&=0xDF
#define    ENABLE_BIT4_FALLINGEDGE_TRIG   PICON|=0x40;PINEN|=0x10;PIPEN&=0xEF
#define    ENABLE_BIT3_FALLINGEDGE_TRIG   PICON|=0x20;PINEN|=0x08;PIPEN&=0xF7
#define    ENABLE_BIT2_FALLINGEDGE_TRIG   PICON|=0x10;PINEN|=0x04;PIPEN&=0xFB
#define    ENABLE_BIT1_FALLINGEDGE_TRIG   PICON|=0x08;PINEN|=0x02;PIPEN&=0xFD
#define    ENABLE_BIT0_FALLINGEDGE_TRIG   PICON|=0x04;PINEN|=0x01;PIPEN&=0xFE
/*    Bit rising edge trig mode    */
#define    ENABLE_BIT7_RISINGEDGE_TRIG    PICON|=0x80;PINEN&=0x7F;PIPEN|=0x80
#define    ENABLE_BIT6_RISINGEDGE_TRIG    PICON|=0x80;PINEN&=0xBF;PIPEN|=0x40
#define    ENABLE_BIT5_RISINGEDGE_TRIG    PICON|=0x40;PINEN&=0xDF;PIPEN|=0x20
#define    ENABLE_BIT4_RISINGEDGE_TRIG    PICON|=0x40;PINEN&=0xEF;PIPEN|=0x10
#define    ENABLE_BIT3_RISINGEDGE_TRIG    PICON|=0x20;PINEN&=0xF7;PIPEN|=0x08
#define    ENABLE_BIT2_RISINGEDGE_TRIG    PICON|=0x10;PINEN&=0xFB;PIPEN|=0x04
#define    ENABLE_BIT1_RISINGEDGE_TRIG    PICON|=0x08;PINEN&=0xFD;PIPEN|=0x02
#define    ENABLE_BIT0_RISINGEDGE_TRIG    PICON|=0x04;PINEN&=0xFE;PIPEN|=0x01
/*    Bit both edge trig mode    */
#define    ENABLE_BIT7_BOTHEDGE_TRIG      PICON|=0x80;PINEN|=0x80;PIPEN|=0x80
#define    ENABLE_BIT6_BOTHEDGE_TRIG      PICON|=0x80;PINEN|=0x40;PIPEN|=0x40
#define    ENABLE_BIT5_BOTHEDGE_TRIG      PICON|=0x40;PINEN|=0x20;PIPEN|=0x20
#define    ENABLE_BIT4_BOTHEDGE_TRIG      PICON|=0x40;PINEN|=0x10;PIPEN|=0x10
#define    ENABLE_BIT3_BOTHEDGE_TRIG      PICON|=0x20;PINEN|=0x08;PIPEN|=0x08
#define    ENABLE_BIT2_BOTHEDGE_TRIG      PICON|=0x10;PINEN|=0x04;PIPEN|=0x04
#define    ENABLE_BIT1_BOTHEDGE_TRIG      PICON|=0x08;PINEN|=0x02;PIPEN|=0x02
#define    ENABLE_BIT0_BOTHEDGE_TRIG      PICON|=0x04;PINEN|=0x01;PIPEN|=0x01

/*****************************************************************************/
/*    TIMER Function Define                                                  */ 
/*****************************************************************************/
#define    ENABLE_CLOCK_OUT             set_CKCON_CLOEN;
/*    Timer0 basic define  */
#define    ENABLE_TIMER0_MODE0           TMOD&=0xF0
#define    ENABLE_TIMER0_MODE1           TMOD&=0xF0;TMOD|=0x01
#define    ENABLE_TIMER0_MODE2           TMOD&=0xF0;TMOD|=0x02
#define    ENABLE_TIMER0_MODE3           TMOD&=0xF0;TMOD|=0x03
#define    TIMER0_FSYS                   set_CKCON_T0M
#define    TIMER0_FSYS_DIV12             clr_CKCON_T0M
#define    TIMER0_MODE0_ENABLE           TMOD&=0xF0
#define    TIMER0_MODE1_ENABLE           TMOD&=0xF0;TMOD|=0x01
#define    TIMER0_MODE2_ENABLE           TMOD&=0xF0;TMOD|=0x02
#define    TIMER0_MODE3_ENABLE           TMOD&=0xF0;TMOD|=0x03
/*    Timer1 basic define  */
#define    ENABLE_TIMER1_MODE0           TMOD&=0x0F
#define    ENABLE_TIMER1_MODE1           TMOD&=0x0F;TMOD|=0x10
#define    ENABLE_TIMER1_MODE2           TMOD&=0x0F;TMOD|=0x20
#define    ENABLE_TIMER1_MODE3           TMOD&=0x0F;TMOD|=0x30
#define    TIMER1_FSYS                   set_CKCON_T1M
#define    TIMER1_FSYS_DIV12             clr_CKCON_T1M
#define    TIMER1_MODE0_ENABLE           TMOD&=0x0F
#define    TIMER1_MODE1_ENABLE           TMOD&=0x0F;TMOD|=0x10
#define    TIMER1_MODE2_ENABLE           TMOD&=0x0F;TMOD|=0x20
#define    TIMER1_MODE3_ENABLE           TMOD&=0x0F;TMOD|=0x30
/*    Timer2 function define  */
#define    TIMER2_DIV_4                  T2MOD|=0x10;T2MOD&=0x9F
#define    TIMER2_DIV_16                 T2MOD|=0x20;T2MOD&=0xAF
#define    TIMER2_DIV_32                 T2MOD|=0x30;T2MOD&=0xBF
#define    TIMER2_DIV_64                 T2MOD|=0x40;T2MOD&=0xCF
#define    TIMER2_DIV_128                T2MOD|=0x50;T2MOD&=0xDF
#define    TIMER2_DIV_256                T2MOD|=0x60;T2MOD&=0xEF
#define    TIMER2_DIV_512                T2MOD|=0x70
#define    TIMER2_AUTO_RELOAD_DELAY_MODE T2CON&=0xFE;T2MOD|=0x80;T2MOD|=0x08
#define    TIMER2_COMPARE_CAPTURE_MODE   T2CON|=0x01;T2MOD&=0x7F;T2MOD|=0x04
#define    TIMER2_CAP0_CAPTURE_MODE      T2CON&=0xFE;T2MOD=0x89
#define    TIMER2_CAP1_CAPTURE_MODE      T2CON&=0xFE;T2MOD=0x8A
#define    TIMER2_CAP2_CAPTURE_MODE      T2CON&=0xFE;T2MOD=0x8B
#define    DISABLE_TIMER2_CAP0           CAPCON0&=0xBF
#define    DISABLE_TIMER2_CAP1           CAPCON0&=0xDF
#define    DISABLE_TIMER2_CAP2           CAPCON0&=0xEF

