nikitalita/NuMicro-8051-prog/bootloader/inc/function_define_n76e003.h
#define    DISABLE_PWM0_CH5_P15_OUTPUT       ENABLE_SFR_PAGE1;PIOCON1&=0xDF;ENABLE_SFR_PAGE0        //P1.5 as PWM5 output disable
#define    DISABLE_PWM0_CH5_P03_OUTPUT       PIOCON0&=0xDF                                                                                 //P0.3 as PWM5               
#define    DISABLE_PWM0_CH4_P01_OUTPUT       PIOCON0&=0xEF                                                                                 //P0.1 as PWM4 output disable
#define    DISABLE_PWM0_CH3_P04_OUTPUT       ENABLE_SFR_PAGE1;PIOCON1&=0xF7;ENABLE_SFR_PAGE0        //P0.4 as PWM3 output disable
#define    DISABLE_PWM0_CH3_P00_OUTPUT       PIOCON0&=0xF7                                                                                 //P0.0 as PWM3               
#define    DISABLE_PWM0_CH2_P05_OUTPUT       ENABLE_SFR_PAGE1;PIOCON1&=0xFB;ENABLE_SFR_PAGE0        //P1.0 as PWM2 output disable
#define    DISABLE_PWM0_CH2_P10_OUTPUT       PIOCON0&=0xFB                                                                                 //P1.0 as PWM2               
#define    DISABLE_PWM0_CH1_P14_OUTPUT       ENABLE_SFR_PAGE1;PIOCON1&=0xFD;ENABLE_SFR_PAGE0        //P1.4 as PWM1 output disable
#define    DISABLE_PWM0_CH1_P11_OUTPUT       PIOCON0&=0xFD                                                                                 //P1.1 as PWM1               
#define    DISABLE_PWM0_CH0_P12_OUTPUT       PIOCON0&=0xFE                                                                                 //P1.2 as PWM0 output disable
#define    DISABLE_ALL_PWM0_OUTPUT           PIOCON0=0x00;PIOCON1=0x00
/*       PWM0 I/O Polarity Control     */
#define    PWM0_CH5_OUTPUT_INVERSE           PNP|=0x20
#define    PWM0_CH4_OUTPUT_INVERSE           PNP|=0x10
#define    PWM0_CH3_OUTPUT_INVERSE           PNP|=0x08
#define    PWM0_CH2_OUTPUT_INVERSE           PNP|=0x04
#define    PWM0_CH1_OUTPUT_INVERSE           PNP|=0x02
#define    PWM0_CH0_OUTPUT_INVERSE           PNP|=0x01
#define    PWM0_OUTPUT_ALL_INVERSE           PNP|=0xFF
#define    PWM0_CH5_OUTPUT_NORMAL            PNP&=0xDF
#define    PWM0_CH4_OUTPUT_NORMAL            PNP&=0xEF
#define    PWM0_CH3_OUTPUT_NORMAL            PNP&=0xF7
#define    PWM0_CH2_OUTPUT_NORMAL            PNP&=0xFB
#define    PWM0_CH1_OUTPUT_NORMAL            PNP&=0xFD
#define    PWM0_CH0_OUTPUT_NORMAL            PNP&=0xFE
#define    PWM0_OUTPUT_ALL_NORMAL            PNP&=0x00
/*      PMW0 interrupt setting     */
#define    PWM0_FALLING_INT                  ENABLE_SFR_PAGE1;PWMINTC&=0xCF;PWMINTC|=0x00;ENABLE_SFR_PAGE0
#define    PWM0_RISING_INT                   ENABLE_SFR_PAGE1;PWMINTC&=0xCF;PWMINTC|=0x10;ENABLE_SFR_PAGE0
#define    PWM0_CENTRAL_POINT_INT            ENABLE_SFR_PAGE1;PWMINTC&=0xCF;PWMINTC|=0x20;ENABLE_SFR_PAGE0
#define    PWM0_PERIOD_END_INT               ENABLE_SFR_PAGE1;PWMINTC&=0xCF;PWMINTC|=0x30;ENABLE_SFR_PAGE0
/*      PWM0 interrupt pin select    */
#define    PWM0_INT_PWM0                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x00;ENABLE_SFR_PAGE0
#define    PWM0_INT_PWM1                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x01;ENABLE_SFR_PAGE0
#define    PWM0_INT_PWM2                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x02;ENABLE_SFR_PAGE0
#define    PWM0_INT_PWM3                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x03;ENABLE_SFR_PAGE0
#define    PWM0_INT_PWM4                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x04;ENABLE_SFR_PAGE0
#define    PWM0_INT_PWM5                     ENABLE_SFR_PAGE1;PWMINTC&=0xF8;PWMINTC|=0x05;ENABLE_SFR_PAGE0
/*      PWM0 Dead time setting     */
#define    ENABLE_PWM0_CH45_DEADTIME         BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x04;EA=BIT_TMP
#define    ENABLE_PWM0_CH23_DEADTIME         BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x02;EA=BIT_TMP
#define    ENABLE_PWM0_CH01_DEADTIME         BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x01;EA=BIT_TMP

/*****************************************************************************/
/*     For ADC INIT setting                                                  */
/*****************************************************************************/
#define    ENABLE_ADC                        set_ADCCON1_ADCEN
#define    DISABLE_ADC                       clr_ADCCON1_ADCEN

#define    ENABLE_ADC_BANDGAP                DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x08;ADCCON0&=0xF8;ENABLE_ADC  
#define    ENABLE_ADC_AIN0                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x00;P17_INPUT_MODE;AINDIDS=0;AINDIDS|=0x01;ENABLE_ADC    //P17
#define    ENABLE_ADC_AIN1                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x01;P30_INPUT_MODE;AINDIDS=0;AINDIDS|=0x02;ENABLE_ADC    //P30
#define    ENABLE_ADC_AIN2                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x02;P07_INPUT_MODE;AINDIDS=0;AINDIDS|=0x04;ENABLE_ADC    //P07
#define    ENABLE_ADC_AIN3                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x03;P06_INPUT_MODE;AINDIDS=0;AINDIDS|=0x08;ENABLE_ADC    //P06
#define    ENABLE_ADC_AIN4                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x04;P05_INPUT_MODE;AINDIDS=0;AINDIDS|=0x10;ENABLE_ADC    //P05
#define    ENABLE_ADC_AIN5                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x05;P04_INPUT_MODE;AINDIDS=0;AINDIDS|=0x20;ENABLE_ADC    //P04
#define    ENABLE_ADC_AIN6                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x06;P03_INPUT_MODE;AINDIDS=0;AINDIDS|=0x40;ENABLE_ADC    //P03
#define    ENABLE_ADC_AIN7                   DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x07;P11_INPUT_MODE;AINDIDS=0;AINDIDS|=0x80;ENABLE_ADC    //P11

#define    ENABLE_ADC_CH0                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x00;P17_INPUT_MODE;AINDIDS=0;AINDIDS|=0x01;ENABLE_ADC    //P17
#define    ENABLE_ADC_CH1                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x01;P30_INPUT_MODE;AINDIDS=0;AINDIDS|=0x02;ENABLE_ADC    //P30
#define    ENABLE_ADC_CH2                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x02;P07_INPUT_MODE;AINDIDS=0;AINDIDS|=0x04;ENABLE_ADC    //P07
#define    ENABLE_ADC_CH3                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x03;P06_INPUT_MODE;AINDIDS=0;AINDIDS|=0x08;ENABLE_ADC    //P06
#define    ENABLE_ADC_CH4                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x04;P05_INPUT_MODE;AINDIDS=0;AINDIDS|=0x10;ENABLE_ADC   //P05
#define    ENABLE_ADC_CH5                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x05;P04_INPUT_MODE;AINDIDS=0;AINDIDS|=0x20;ENABLE_ADC    //P04
#define    ENABLE_ADC_CH6                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x06;P03_INPUT_MODE;AINDIDS=0;AINDIDS|=0x40;ENABLE_ADC    //P03
#define    ENABLE_ADC_CH7                    DISABLE_ADC;ADCCON0&=0xF0;ADCCON0|=0x07;P11_INPUT_MODE;AINDIDS=0;AINDIDS|=0x80;ENABLE_ADC    //P11
/*      GPIO trig ADC start define*/
#define    P04_FALLINGEDGE_TRIG_ADC          ADCCON0|=0x30;ADCCON1&=0xBF;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    P13_FALLINGEDGE_TRIG_ADC          ADCCON0|=0x30;ADCCON1|=0x40;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    P04_RISINGEDGE_TRIG_ADC           ADCCON0|=0x30;ADCCON1&=0xBF;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    P13_RISINGEDGE_TRIG_ADC           ADCCON0|=0x30;ADCCON1&=0xF7;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
/*      PWM trig ADC start define */ 
#define    PWM0_FALLINGEDGE_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM2_FALLINGEDGE_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM4_FALLINGEDGE_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_RISINGEDGE_TRIG_ADC          ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM2_RISINGEDGE_TRIG_ADC          ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM4_RISINGEDGE_TRIG_ADC          ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CENTRAL_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM2_CENTRAL_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM4_CENTRAL_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_END_TRIG_ADC                 ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM2_END_TRIG_ADC                 ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM4_END_TRIG_ADC                 ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02

