nikitalita/NuMicro-8051-prog/bootloader/inc/function_define_n76e003.h
#define    PWM0_CH0_FALLINGEDGE_TRIG_ADC     ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_CH2_FALLINGEDGE_TRIG_ADC     ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_CH4_FALLINGEDGE_TRIG_ADC     ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH0_RISINGEDGE_TRIG_ADC      ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH2_RISINGEDGE_TRIG_ADC      ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH4_RISINGEDGE_TRIG_ADC      ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x06;ADCCON1|=0x02
#define    PWM0_CH0_CENTRAL_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH2_CENTRAL_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH4_CENTRAL_TRIG_ADC         ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH0_END_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM0_CH2_END_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM0_CH4_END_TRIG_ADC             ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02

/*****************************************************************************/
/*     For SPI INIT setting                                                  */
/*****************************************************************************/
#define    SPICLK_FSYS_DIV2                  SPCR&=0xFC
#define    SPICLK_FSYS_DIV4                  SPCR&=0xFC;SPCR|=0x01
#define    SPICLK_FSYS_DIV8                  SPCR&=0xFC;SPCR|=0x02
#define    SPICLK_FSYS_DIV16                 SPCR&=0xFC;SPCR|=0x03
#define    SS    P15
/*****************************************************************************/
/*     For UART0 and UART1 and printf funcion                                */
/*****************************************************************************/
#define    ENABLE_UART0_PRINTF                set_SCON_TI;PRINTFG=1            //For printf function must setting TI = 1
#define    DISABLE_UART0_PRINTF               clr_SCON_TI;PRINTFG=0
#define    ENABLE_UART1_PRINTF                set_SCON_1_TI_1;PRINTFG=1
#define    DISABLE_UART1_PRINTF               clr_SCON_1_TI_1;PRINTFG=0
/*****************************************************************************/
/*     INT0 setting                                                          */
/*****************************************************************************/
#define    INT0_FALLING_EDGE_TRIG             set_TCON_IT0
#define    INT0_LOW_LEVEL_TRIG                clr_TCON_IT0
/*****************************************************************************/
/*     INT1 setting                                                          */
/*****************************************************************************/
#define    INT1_FALLING_EDGE_TRIG             set_TCON_IT1
#define    INT1_LOW_LEVEL_TRIG                clr_TCON_IT1

/*****************************************************************************/
/*     WDT setting                                                           */
/*****************************************************************************/
#define    WDT_TIMEOUT_6MS                    TA=0xAA;TA=0x55;WDCON&=0xF8
#define    WDT_TIMEOUT_25MS                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x01
#define    WDT_TIMEOUT_50MS                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x02
#define    WDT_TIMEOUT_100MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x03
#define    WDT_TIMEOUT_200MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x04
#define    WDT_TIMEOUT_400MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x05
#define    WDT_TIMEOUT_800MS                  TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x06
#define    WDT_TIMEOUT_1_6S                   TA=0xAA;TA=0x55;WDCON&=0xF8;WDCON|=0x07

#define    WDT_RUN_IN_POWERDOWN_ENABLE        set_WDCON_WIDPD
#define    WDT_RUN_IN_POWERDOWN_DISABLE       clr_WDCON_WIDPD
#define    WDT_COUNTER_CLEAR                  set_WDCON_WDCLR
#define    WDT_COUNTER_RUN                    set_WDCON_WDTR



/*****************************************************************************/
/*     Power-on-Reset setting                                                */
/*****************************************************************************/
/** 
 * Per N76E003 errata sheet rev. 1.02, section 2.1, it is recommended that POR be disabled before entering power-down mode:
 * 
 * ## 2.1 POR reset issue when wake up from Power-down mode
 * ### Description:
 *     - When N76E003 wakes up from Power-down mode, a reset caused by internal POR might
 *     occur. User should disable POR before CPU entering Power-down mode when programming.
 * ### Problem:
 *     - The problem happens when N76E003 wakes up from Power-down mode. Sometimes the
 *       internal logic circuit power will drop below POR threshold voltage level and will trigger POR to
 *       reset N76E003.
 * ### Workaround:
 *     - It is suggested that disabling the POR function before entering Power-down mode. POR is
 *       only to make sure the N76E003 can work functionally when power on. After system power on,
 *       the Low Voltage Reset (LVR) function will monitor voltage value during system operation.
 * ### How to disable POR:
 *     - Set the value of POR control register “PORDIS” addressed at FDH. Write 0x5A and 0xA5 to
 *       the PORDIS to disable POR.
 */
#define DISABLE_POWER_ON_RESET              tmp_clr_EA(_enable_TA;SFRS=0;_enable_TA;PORDIS=0x5A;_enable_TA;PORDIS=0xA5)